src/main/resources/xml/accommodationBatchComponentWSPort/stageMassCancelTransactional/stageMassCancelTransactional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bat="http://batch.accommodation.services.booking.dreams.wdw.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <bat:stageMassCancelTransactional>
         <!--Optional:-->
         <massCancelRequest>
            <!--Optional:-->
            <processName>?</processName>
            <!--Zero or more repetitions:-->
            <massCancelAccommodationRequestDetails>
               <cancelContactName>?</cancelContactName>
               <cancelDate>?</cancelDate>
               <cancelReasonCode>?</cancelReasonCode>
               <externalReferenceDetail>
                  <!--Optional:-->
                  <externalReferenceType>?</externalReferenceType>
                  <!--Optional:-->
                  <externalReferenceCode>?</externalReferenceCode>
                  <!--Optional:-->
                  <externalReferenceNumber>?</externalReferenceNumber>
                  <!--Optional:-->
                  <externalReferenceSource>?</externalReferenceSource>
               </externalReferenceDetail>
               <isOverridden>?</isOverridden>
               <isWaived>?</isWaived>
               <overriddenCancelFee>?</overriddenCancelFee>
               <travelComponentGroupingId>?</travelComponentGroupingId>
            </massCancelAccommodationRequestDetails>
         </massCancelRequest>
         <!--Optional:-->
         <context>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </context>
      </bat:stageMassCancelTransactional>
   </soapenv:Body>
</soapenv:Envelope>